course/数理逻辑/notes/Orders.org
#+TITLE: 序

#+AUTHOR: 陈淇奥

#+LATEX_HEADER: \usepackage[UTF8]{ctex}
#+LATEX_HEADER: \usepackage{amsthm}
#+LATEX_HEADER: \theoremstyle{definition}
#+LATEX_HEADER: \newtheorem{definition}{定义}
#+LATEX_HEADER: \newtheorem{proposition}{命题}
#+OPTIONS: toc:nil


首先我们看偏序与严格偏序的定义，因为课本上给出的严格偏序并不是一个严格的定义
#+ATTR_LATEX: :options []
#+BEGIN_definition
令\(\le\)为\(X\)上的二元关系，如果\(\le\)满足
1. \(\le\) 是自反的，即对所有的\(x\in X\),\(x\le x\)
2. \(\le\)是反对称(antisymmetry)的，即对所有的\(x,y\in X\)，如果\(x\le y\)且\(y\le x\)，则\(x=y\)
3. \(\le\)是传递的，即对所有的\(x,y,z\in X\),如果\(x\le y\),\(y\le z\)，则\(x\le z\)


就称\(\le\)是\(X\)上的一个 *偏序*
#+END_definition

#+ATTR_LATEX: :options []
#+BEGIN_definition
令\(<\)为\(X\)上的二元关系，如果\(<\)满足
1. \(<\) 是非自反的，即对所有的\(x\in X\),\(x< x\)不成立
2. \(<\)是非对称（asymmetry）的，即对所有的\(x,y\in X\)，如果\(x< y\)，那么并非\(y<x\)
3. \(<\)是传递的，即对所有的\(x,y,z\in X\),如果\(x< y\),\(y< z\)，则\(x< z\)


就称\(<\)是\(X\)上的一个 *严格偏序*
#+END_definition

注意，antisymmetry跟asymmetry在非自反的条件下是等价的

#+ATTR_LATEX: :options []
#+BEGIN_proposition
令\(R\)是\(X\)上的二元关系，如果\(R\)是非自反的，那么\(R\)是反对称的当且仅当\(R\)是asymmetry的
#+END_proposition

#+BEGIN_proof
1. 如果\(R\)是反对称的，我们使用反证法，如果存在\(x,y\in X\)使得\(xRy\)且\(yRx\)，于是\(x=y\)，于是我
   们有\(xRx\)，与自反性矛盾
2. 如果\(R\)是asymmetric的，对于任意\(x,y\in X\)，如果\(xRy\)并且\(yRx\)，我们知道这是错误的，于
   是\(R\)是反对称的


因此在非自反的条件下，这两个概念是等价的
#+END_proof

有了以上的讨论，我们来看
\begin{equation*}
D=\{(x,y)\mid y\text{是$x$的祖先}\}
\end{equation*}
首先它是非自反的，是传递的，同时你们的讨论也是对的，它是反对称的（你也可以证明它是asymmetric的），因
此它是严格偏序
