course/数理逻辑/notes/Orders.tex
% Created 2021-09-18 Sat 16:31
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[UTF8]{ctex}
\usepackage{amsthm}
\theoremstyle{definition}
\newtheorem{definition}{定义}
\newtheorem{proposition}{命题}
\author{陈淇奥}
\date{\today}
\title{序}
\hypersetup{
 pdfauthor={陈淇奥},
 pdftitle={序},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.5)}, 
 pdflang={English}}
\begin{document}

\maketitle
首先我们看偏序与严格偏序的定义，因为课本上给出的严格偏序并不是一个严格的定义
\begin{definition}[]
令\(\le\)为\(X\)上的二元关系，如果\(\le\)满足
\begin{enumerate}
\item \(\le\) 是自反的，即对所有的\(x\in X\),\(x\le x\)
\item \(\le\)是反对称的(antisymmetry)，即对所有的\(x,y\in X\)，如果\(x\le y\)且\(y\le x\)，则\(x=y\)
\item \(\le\)是传递的，即对所有的\(x,y,z\in X\),如果\(x\le y\),\(y\le z\)，则\(x\le z\)
\end{enumerate}


就称\(\le\)是\(X\)上的一个 \textbf{偏序}
\end{definition}

\begin{definition}[]
令\(<\)为\(X\)上的二元关系，如果\(<\)满足
\begin{enumerate}
\item \(<\) 是非自反的，即对所有的\(x\in X\),\(x< x\)不成立
\item \(<\)是asymmetry，即对所有的\(x,y\in X\)，如果\(x< y\)，那么并非\(y<x\)
\item \(<\)是传递的，即对所有的\(x,y,z\in X\),如果\(x< y\),\(y< z\)，则\(x< z\)
\end{enumerate}


就称\(<\)是\(X\)上的一个 \textbf{严格偏序}
\end{definition}

注意，antisymmetry跟asymmetry在非自反的条件下是等价的

\begin{proposition}[]
令\(R\)是\(X\)上的二元关系，如果\(R\)是非自反的，那么\(R\)是反对称的当且仅当\(R\)是asymmetry的
\end{proposition}

\begin{proof}
\begin{enumerate}
\item 如果\(R\)是反对称的，我们使用反证法，如果存在\(x,y\in X\)使得\(xRy\)且\(yRx\)，于是\(x=y\)，于是我
们有\(xRx\)，与自反性矛盾
\item 如果\(R\)是asymmetric的，对于任意\(x,y\in X\)，如果\(xRy\)并且\(yRx\)，我们知道这是错误的，于
是\(R\)是反对称的
\end{enumerate}


因此在非自反的条件下，这两个概念是等价的
\end{proof}

有了以上的讨论，我们来看
\begin{equation*}
D=\{(x,y)\mid y\text{是$x$的祖先}\}
\end{equation*}
首先它是非自反的，是传递的，同时你们的讨论也是对的，它是反对称的（你也可以证明它是asymmetric的），因
此它是严格偏序
\end{document}
